open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_wdt.c
/****************************************************************************
 * chips/bk7258/cp/bk7258_wdt.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 hardware watchdog NuttX lower-half driver — SDK wrapper.
 *
 * Calls bk_wdt_* / bk_aon_wdt_* SDK APIs.  Zero register access.
 *
 * The bootloader arms both APB + AON WDTs (~8 s).  The CP reset entry closes
 * both before nx_start(); this driver is registered after bounded AP
 * autostart and manages the APB WDT through the NuttX automonitor.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_WDT

/* Feeding serializes the SDK's two-key sequence with a mutex.  The NuttX
 * automonitor must therefore call it from a worker task, not a timer ISR.
 */

#if defined(CONFIG_WATCHDOG_AUTOMONITOR) && \
    !defined(CONFIG_WATCHDOG_AUTOMONITOR_BY_LPWORK) && \
    !defined(CONFIG_WATCHDOG_AUTOMONITOR_BY_HPWORK)
#  error "BK7258 watchdog automonitor requires LPWORK or HPWORK"
#endif

#include <stdint.h>
#include <errno.h>
#include <string.h>
#include <syslog.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/syslog/syslog.h>
#include <nuttx/timers/watchdog.h>
#include <nuttx/wdog.h>
#include <nuttx/wqueue.h>

#include <arch/chip/bk7258_reset_cause.h>
#include <arch/chip/bk7258_system_reset.h>

#include "bk7258_wdt.h"
#include "bk7258_reset_marker_internal.h"

/* SDK API headers */

#include <driver/wdt.h>
#include <driver/aon_wdt.h>
#include <driver/timer.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_WDT_DEFAULT_TIMEOUT_MS  8000u
#define BK7258_WDT_MAX_TIMEOUT_MS      0xFFFFu

/* The BK7258 SDK exposes no pre-timeout interrupt for either watchdog, so
 * the xTS watchdog contract (panic with context before the hardware reset)
 * is delivered through a NuttX software timer armed slightly ahead of the
 * hardware expiry.  The handler prints the context and routes the reset
 * through the AON watchdog so the recorded reset reason stays in the WDT
 * family.  A hard irq-disabled spin (xTS case -r 1) cannot wake a software
 * timer; the plain hardware reset then still reports SYS_RWDT. */

#ifdef CONFIG_BK7258_WDT_PRETIMEOUT_PANIC

#define BK7258_WDT_PRETIMEOUT_ARM_GUARD_MS 100u

#endif

#ifdef CONFIG_BK7258_WDT_FAULT_INJECTION
#  define BK7258_WDT_FAULT_MAGIC       0x46445742u /* "BWDF" */
#  define BK7258_WDT_FAULT_VERSION     1u
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_wdt_lowerhalf_s
{
  struct watchdog_lowerhalf_s wdt_lh;  /* Must be first */
  mutex_t lock;                        /* Serializes the two-key feed/start
                                        * sequences against the second
                                        * feeder context (automonitor vs
                                        * client ioctl); the SDK assumes a
                                        * single feeder owner. */
  xcpt_t handler;                      /* Pre-expiry capture callback */
  struct work_s capture_work;          /* Deferred capture notification */
#ifdef CONFIG_BK7258_WDT_PRETIMEOUT_PANIC
  struct work_s panic_work;            /* Task-context marker + reset */
  uint32_t pretimeout_generation;      /* Invalidates stale queued work */
  uint32_t panic_generation;           /* Generation observed by timer */
#endif
  uint32_t timeout;                    /* Current timeout in ms */
  clock_t  last_feed;                  /* Tick of the most recent feed */
  bool     started;                    /* WDT is armed */
};

#ifdef CONFIG_BK7258_WDT_FAULT_INJECTION
enum bk7258_wdt_fault_e
{
  BK7258_WDT_FAULT_NONE = 0,
  BK7258_WDT_FAULT_TIMER_STOP,
  BK7258_WDT_FAULT_AON_STOP,
  BK7258_WDT_FAULT_WDT_STOP,
  BK7258_WDT_FAULT_WDT_START,
};

struct bk7258_wdt_fault_diag_s
{
  uint32_t magic;
  uint32_t version;
  uint32_t size;
  uint32_t state;
  int32_t result;
  int32_t init_timer_stop;
  int32_t init_aon_stop;
  int32_t init_retry;
  int32_t failed_stop;
  uint32_t active_after_failed_stop;
  int32_t retry_stop;
  uint32_t active_after_retry_stop;
  int32_t restart;
  uint32_t active_after_failed_restore;
  int32_t recovery_start;
  uint32_t final_active;
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_wdt_start(struct watchdog_lowerhalf_s *lower);
static int bk7258_wdt_stop(struct watchdog_lowerhalf_s *lower);
static int bk7258_wdt_keepalive(struct watchdog_lowerhalf_s *lower);
static int bk7258_wdt_getstatus(struct watchdog_lowerhalf_s *lower,
                                struct watchdog_status_s *status);
static int bk7258_wdt_settimeout(struct watchdog_lowerhalf_s *lower,
                                 uint32_t timeout);
static xcpt_t bk7258_wdt_capture(struct watchdog_lowerhalf_s *lower,
                                 CODE xcpt_t newhandler);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct watchdog_ops_s g_bk7258_wdt_ops =
{
  .start      = bk7258_wdt_start,
  .stop       = bk7258_wdt_stop,
  .keepalive  = bk7258_wdt_keepalive,
  .getstatus  = bk7258_wdt_getstatus,
  .settimeout = bk7258_wdt_settimeout,
  .capture    = bk7258_wdt_capture,
};

static struct bk7258_wdt_lowerhalf_s g_bk7258_wdt =
{
  .lock = NXMUTEX_INITIALIZER,
};
static bool g_bk7258_wdt_pm_resume;

#ifdef CONFIG_BK7258_WDT_FAULT_INJECTION
volatile struct bk7258_wdt_fault_diag_s g_bk7258_wdt_fault_diag;
static volatile enum bk7258_wdt_fault_e g_bk7258_wdt_fault_next;

static bool bk7258_wdt_fault_take(enum bk7258_wdt_fault_e fault)
{
  irqstate_t flags;
  bool take;

  flags = up_irq_save();
  take = g_bk7258_wdt_fault_next == fault;
  if (take)
    {
      g_bk7258_wdt_fault_next = BK7258_WDT_FAULT_NONE;
    }

  up_irq_restore(flags);
  return take;
}

static bk_err_t bk7258_wdt_sdk_timer_stop(timer_id_t timer_id)
{
  if (bk7258_wdt_fault_take(BK7258_WDT_FAULT_TIMER_STOP))
    {
      return (bk_err_t)-1;
    }

  return bk_timer_stop(timer_id);
}

static bk_err_t bk7258_wdt_sdk_aon_stop(void)
{
  if (bk7258_wdt_fault_take(BK7258_WDT_FAULT_AON_STOP))
    {
      return (bk_err_t)-1;
    }

  return bk_aon_wdt_stop();
}

