open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_wdt.c
static bk_err_t bk7258_wdt_sdk_stop(void)
{
  if (bk7258_wdt_fault_take(BK7258_WDT_FAULT_WDT_STOP))
    {
      return (bk_err_t)-1;
    }

  return bk_wdt_stop();
}

static bk_err_t bk7258_wdt_sdk_start(uint32_t timeout)
{
  if (bk7258_wdt_fault_take(BK7258_WDT_FAULT_WDT_START))
    {
      return (bk_err_t)-1;
    }

  return bk_wdt_start(timeout);
}
#else
#  define bk7258_wdt_sdk_timer_stop bk_timer_stop
#  define bk7258_wdt_sdk_aon_stop   bk_aon_wdt_stop
#  define bk7258_wdt_sdk_stop       bk_wdt_stop
#  define bk7258_wdt_sdk_start      bk_wdt_start
#endif

/****************************************************************************
 * Private: pre-timeout panic hook
 ****************************************************************************/

#ifdef CONFIG_BK7258_WDT_PRETIMEOUT_PANIC

static struct wdog_s g_bk7258_wdt_pretimeout;

static void bk7258_wdt_capture_notify(void *arg)
{
  FAR struct bk7258_wdt_lowerhalf_s *priv =
    (FAR struct bk7258_wdt_lowerhalf_s *)arg;

  if (priv != NULL && priv->handler != NULL)
    {
      priv->handler(0, NULL, priv);
    }
}

static void bk7258_wdt_pretimeout_panic(void *arg)
{
  FAR struct bk7258_wdt_lowerhalf_s *priv =
    (FAR struct bk7258_wdt_lowerhalf_s *)arg;
  uint32_t generation;
  uint32_t elapsed_ticks;
  uint32_t threshold_ticks;
  int ret;

  if (priv == NULL || nxmutex_lock(&priv->lock) < 0)
    {
      return;
    }

  generation = __atomic_load_n(&priv->pretimeout_generation,
                               __ATOMIC_ACQUIRE);
  if (!priv->started ||
      __atomic_load_n(&priv->panic_generation, __ATOMIC_ACQUIRE) != generation)
    {
      nxmutex_unlock(&priv->lock);
      return;
    }

  elapsed_ticks = (uint32_t)(clock_systime_ticks() - priv->last_feed);
  threshold_ticks = MSEC2TICK(priv->timeout -
                              CONFIG_BK7258_WDT_PRETIMEOUT_MARGIN_MS);
  if (elapsed_ticks < threshold_ticks)
    {
      /* A keepalive raced the timer callback before this worker acquired
       * the lower-half lock.  Its generation normally catches that race;
       * retain the time check as an independent fail-safe.
       */

      nxmutex_unlock(&priv->lock);
      return;
    }

  /* Flash is forbidden in the watchdog timer interrupt.  At this point a
   * task-context worker has revalidated the missed-feed generation, so the
   * marker records a confirmed pretimeout rather than merely an armed WDT.
   * A failed marker is diagnostic only: the PMU reason and hardware reset
   * remain authoritative.
   */

  ret = bk7258_reset_marker_stamp(BK7258_RESET_SOURCE_WATCHDOG);
  if (ret < 0)
    {
      syslog(LOG_ERR, "BWDT confirmed marker stamp failed: %d\n", ret);
    }
  else
    {
      syslog(LOG_INFO, "BWDT confirmed marker stamped\n");
    }

  syslog_flush();
  bk7258_system_reset(BK7258_RESET_SOURCE_WATCHDOG);
}

static void bk7258_wdt_pretimeout_expired(wdparm_t arg)
{
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;
  uint32_t generation = (uint32_t)arg;
  int ret;

  if (priv->handler != NULL)
    {
      /* A capture client registered through WDIOC_CAPTURE: defer the
       * notification to the LPWORK queue - the client callback may take
       * semaphores, which is illegal in this timer-interrupt context.
       * The armed APB watchdog remains the last-resort reset source. */

      work_queue(LPWORK, &priv->capture_work, bk7258_wdt_capture_notify,
                 priv, 0);
      return;
    }

  /* Runs in timer-interrupt context: emit the bounded crash record now, then
   * defer persistent Flash evidence and the whole-device reset to LPWORK.
   * If that task cannot run, the armed APB watchdog/NMI path is still the
   * final reset source and records its own PMU reason.
   */

  syslog(LOG_CRIT,
         "BK7258 WDT PRETIMEOUT panic: no keepalive, timeout=%" PRIu32
         " ms; scheduling whole-device reset\n", priv->timeout);

  /* This is a deliberate direct-syslog crash-path exception: debug macros
   * can be compiled out, while the xTS contract requires this final reason.
   * Flush the interrupt buffer through the channel's non-blocking force
   * operation before the AON watchdog takes the whole device down. */

  syslog_flush();

  __atomic_store_n(&priv->panic_generation, generation, __ATOMIC_RELEASE);
  ret = work_queue(LPWORK, &priv->panic_work,
                   bk7258_wdt_pretimeout_panic, priv, 0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "BWDT panic worker queue failed: %d\n", ret);
      syslog_flush();
      bk7258_system_reset(BK7258_RESET_SOURCE_WATCHDOG);
    }
}

static void bk7258_wdt_pretimeout_arm(uint32_t timeout)
{
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;
  uint32_t margin = CONFIG_BK7258_WDT_PRETIMEOUT_MARGIN_MS;
  uint32_t generation;

  generation = __atomic_add_fetch(&priv->pretimeout_generation, 1u,
                                  __ATOMIC_ACQ_REL);
  (void)work_cancel(LPWORK, &priv->panic_work);

  if (timeout <= margin + BK7258_WDT_PRETIMEOUT_ARM_GUARD_MS)
    {
      /* Too short to split; rely on the plain hardware reset. */

      wd_cancel(&g_bk7258_wdt_pretimeout);
      return;
    }

  wd_start(&g_bk7258_wdt_pretimeout, MSEC2TICK(timeout - margin),
           bk7258_wdt_pretimeout_expired, (wdparm_t)generation);
}

static void bk7258_wdt_pretimeout_cancel(void)
{
  __atomic_add_fetch(&g_bk7258_wdt.pretimeout_generation, 1u,
                     __ATOMIC_ACQ_REL);
  wd_cancel(&g_bk7258_wdt_pretimeout);
  (void)work_cancel(LPWORK, &g_bk7258_wdt.panic_work);
}

#else

#define bk7258_wdt_pretimeout_arm(timeout)   ((void)(timeout))
#define bk7258_wdt_pretimeout_cancel()       ((void)0)

#endif

static xcpt_t bk7258_wdt_capture(struct watchdog_lowerhalf_s *lower,
                                 CODE xcpt_t newhandler)
{
  FAR struct bk7258_wdt_lowerhalf_s *priv =
    (FAR struct bk7258_wdt_lowerhalf_s *)lower;
  irqstate_t flags;
  CODE xcpt_t oldhandler;

  flags = up_irq_save();
  oldhandler = priv->handler;
  priv->handler = newhandler;
  up_irq_restore(flags);
  return oldhandler;
}

/****************************************************************************
 * Private: lower-half operations
 ****************************************************************************/

static int bk7258_wdt_start(struct watchdog_lowerhalf_s *lower)
{
  struct bk7258_wdt_lowerhalf_s *priv =
    (struct bk7258_wdt_lowerhalf_s *)lower;
  int ret = OK;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return -EINVAL;
    }

  if (bk7258_wdt_sdk_start(priv->timeout) != BK_OK)
    {
      wderr("ERROR: bk_wdt_start failed\n");
      ret = -EIO;
    }
  else
    {
      priv->last_feed = clock_systime_ticks();
      priv->started = true;
      wdinfo("started, timeout=%" PRIu32 " ms\n", priv->timeout);
    }

  if (ret == OK)
    {
      bk7258_wdt_pretimeout_arm(priv->timeout);
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

