open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_wdt.c
static int bk7258_wdt_stop(struct watchdog_lowerhalf_s *lower)
{
  struct bk7258_wdt_lowerhalf_s *priv =
    (struct bk7258_wdt_lowerhalf_s *)lower;
  int ret = OK;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return -EINVAL;
    }

  if (bk7258_wdt_sdk_stop() != BK_OK)
    {
      wderr("ERROR: bk_wdt_stop failed\n");
      nxmutex_unlock(&priv->lock);
      return -EIO;
    }

  bk7258_wdt_pretimeout_cancel();

  /* The NuttX lower half owns the APB watchdog.  Commit its stopped state
   * after that hardware transition succeeds, even if the independent AON
   * watchdog subsequently reports an error.
   */

  priv->started = false;
  if (bk7258_wdt_sdk_aon_stop() != BK_OK)
    {
      wderr("ERROR: bk_aon_wdt_stop failed\n");
      nxmutex_unlock(&priv->lock);
      return -EIO;
    }

  priv->last_feed = 0;
  wdinfo("stopped\n");
  nxmutex_unlock(&priv->lock);
  return ret;
}

static int bk7258_wdt_keepalive(struct watchdog_lowerhalf_s *lower)
{
  struct bk7258_wdt_lowerhalf_s *priv =
    (struct bk7258_wdt_lowerhalf_s *)lower;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return -EINVAL;
    }

  /* The SDK feed performs a two-key register sequence; concurrent access
   * from a second feeder context can corrupt one attempt, and a lost feed
   * cascades into starvation because later key writes stay unbalanced.
   * Retry once before reporting failure. */

  if (bk_wdt_feed() != BK_OK && bk_wdt_feed() != BK_OK)
    {
      nxmutex_unlock(&priv->lock);
      return -EIO;
    }

  /* Hot path: no flash access here.  Persistent evidence is written only
   * after a generation-checked pretimeout, never merely because the WDT is
   * armed or fed.
   */

  priv->last_feed = clock_systime_ticks();
  bk7258_wdt_pretimeout_arm(priv->timeout);
  nxmutex_unlock(&priv->lock);
  return OK;
}

static int bk7258_wdt_getstatus(struct watchdog_lowerhalf_s *lower,
                                struct watchdog_status_s *status)
{
  struct bk7258_wdt_lowerhalf_s *priv =
    (struct bk7258_wdt_lowerhalf_s *)lower;

  if (status == NULL)
    {
      return -EINVAL;
    }

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return -EINVAL;
    }

  status->flags = WDFLAGS_RESET;
  if (priv->started)
    {
      status->flags |= WDFLAGS_ACTIVE;
    }

  status->timeout = priv->timeout;

  /* The APB WDT counter is not readable; derive timeleft from the tick of
   * the most recent keepalive so xTS -r 3 sees a monotonic countdown. */

  if (priv->started && priv->last_feed != 0)
    {
      /* Pure 32-bit tick math: avoid libgcc's __udivmoddi4, which has been
       * observed faulting when the division runs while the system timer
       * interrupt is also active on this profile. */

      uint32_t elapsed_ticks = (uint32_t)(clock_systime_ticks() -
                                          priv->last_feed);
      uint32_t elapsed_ms = elapsed_ticks *
                            (1000u / CLOCKS_PER_SEC);

      status->timeleft = elapsed_ms >= priv->timeout ?
                         0 : priv->timeout - elapsed_ms;
    }
  else
    {
      status->timeleft = priv->timeout;
    }

  nxmutex_unlock(&priv->lock);
  return OK;
}

static int bk7258_wdt_settimeout(struct watchdog_lowerhalf_s *lower,
                                 uint32_t timeout)
{
  struct bk7258_wdt_lowerhalf_s *priv =
    (struct bk7258_wdt_lowerhalf_s *)lower;
  uint32_t previous;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return -EINVAL;
    }

  if (timeout == 0)
    {
      nxmutex_unlock(&priv->lock);
      return -EINVAL;
    }

  if (timeout > BK7258_WDT_MAX_TIMEOUT_MS)
    {
      timeout = BK7258_WDT_MAX_TIMEOUT_MS;
    }

  previous = priv->timeout;
  priv->timeout = timeout;

  /* If already running, re-arm with new period.
   * bk_wdt_start() internally does soft_reset + key sequence. */

  if (priv->started)
    {
      if (bk7258_wdt_sdk_start(priv->timeout) != BK_OK)
        {
          priv->timeout = previous;
          nxmutex_unlock(&priv->lock);
          return -EIO;
        }

      priv->last_feed = clock_systime_ticks();
      bk7258_wdt_pretimeout_arm(priv->timeout);
    }

  wdinfo("timeout set to %" PRIu32 " ms\n", priv->timeout);
  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_wdt_initialize
 *
 * Description:
 *   Initialize the BK7258 WDT and register as /dev/watchdog0.
 *
 *   Keep AON WDT disabled and register the APB WDT for NuttX automonitor.
 *   The CP reset entry has already closed both bootloader watchdogs before
 *   nx_start(), so registration establishes a fresh OS-owned timeout.
 *
 *   APB WDT is managed by NuttX automonitor (CONFIG_WATCHDOG_AUTOMONITOR):
 *   register triggers start + periodic keepalive via work queue.
 *
 ****************************************************************************/

int bk7258_wdt_initialize(void)
{
  static bool s_inited;
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;
  void *handle;
  bk_err_t err;
#ifdef CONFIG_BK7258_WDT_PRETIMEOUT_PANIC
  int ret;
#endif

  if (s_inited)
    {
      return OK;
    }

  /* Initialize the SDK WDT state, then stop its TIMER_ID2 feeder.  NuttX
   * automonitor owns periodic keepalive through bk_wdt_feed(). */

  err = bk_timer_driver_init();
  if (err != BK_OK)
    {
      wderr("ERROR: bk_timer_driver_init failed\n");
      return -EIO;
    }

  if (!bk_wdt_is_driver_inited())
    {
      err = bk_wdt_driver_init();
      if (err != BK_OK)
        {
          wderr("ERROR: bk_wdt_driver_init failed\n");
          return -EIO;
        }
    }

  err = bk7258_wdt_sdk_timer_stop(TIMER_ID2);
  if (err != BK_OK)
    {
      wderr("ERROR: failed to stop SDK WDT feeder timer\n");
      return -EIO;
    }

  /* Stop the bootloader's AON WDT before registering the NuttX lower-half.
   * AON WDT is not managed by the NuttX watchdog framework. */

  err = bk7258_wdt_sdk_aon_stop();
  if (err != BK_OK)
    {
      wderr("ERROR: failed to stop boot AON watchdog\n");
      return -EIO;
    }

#ifdef CONFIG_BK7258_WDT_PRETIMEOUT_PANIC
  ret = bk7258_reset_marker_capture_previous();
  if (ret < 0)
    {
      wderr("ERROR: failed to capture prior reset marker: %d\n", ret);
      return ret;
    }
#endif

