open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_wdt.c
  priv->wdt_lh.ops = &g_bk7258_wdt_ops;
  priv->timeout    = BK7258_WDT_DEFAULT_TIMEOUT_MS;
  priv->started    = false;

  handle = watchdog_register("/dev/watchdog0",
                             (struct watchdog_lowerhalf_s *)priv);
  if (handle == NULL)
    {
      wderr("ERROR: watchdog_register failed\n");
      return -ENOMEM;
    }

  s_inited = true;

  wdinfo("BK7258 WDT registered, default timeout=%" PRIu32 " ms\n",
         priv->timeout);
  return OK;
}

int bk7258_wdt_service(void)
{
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;
  int ret = OK;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return -EINVAL;
    }

  if (priv->started)
    {
      /* OTA checkpoints are a second feeder context.  Serialize their SDK
       * two-key sequence with automonitor and re-arm the software pretimeout
       * from the same feed timestamp.
       */

      if (bk_wdt_feed() != BK_OK && bk_wdt_feed() != BK_OK)
        {
          ret = -EIO;
        }
      else
        {
          priv->last_feed = clock_systime_ticks();
          bk7258_wdt_pretimeout_arm(priv->timeout);
        }
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

void bk7258_wdt_pm_prepare(void)
{
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;

  g_bk7258_wdt_pm_resume = priv->started;
  if (priv->started)
    {
      /* Feed immediately before the immutable low-voltage leaf closes the
       * APB watchdog behind the NuttX lower half.
       */

      if (bk_wdt_feed() != BK_OK)
        {
          wderr("ERROR: watchdog feed before PM transition failed\n");
        }
    }
}

void bk7258_wdt_pm_restore(void)
{
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;

  if (g_bk7258_wdt_pm_resume)
    {
      if (bk7258_wdt_sdk_start(priv->timeout) != BK_OK)
        {
          /* The low-voltage leaf closed the hardware watchdog.  Do not
           * continue advertising ACTIVE after a failed restore.
           */

          priv->started = false;
          wderr("ERROR: watchdog restore after PM transition failed\n");
        }
    }

  g_bk7258_wdt_pm_resume = false;
}

#ifdef CONFIG_BK7258_WDT_FAULT_INJECTION
int bk7258_wdt_fault_validate(void)
{
  volatile struct bk7258_wdt_fault_diag_s *diag =
    &g_bk7258_wdt_fault_diag;
  struct watchdog_status_s status;
  struct bk7258_wdt_lowerhalf_s *priv = &g_bk7258_wdt;
  int ret;

  memset((void *)diag, 0, sizeof(*diag));
  diag->magic = BK7258_WDT_FAULT_MAGIC;
  diag->version = BK7258_WDT_FAULT_VERSION;
  diag->size = sizeof(*diag);
  diag->state = 1;

  g_bk7258_wdt_fault_next = BK7258_WDT_FAULT_TIMER_STOP;
  ret = bk7258_wdt_initialize();
  diag->init_timer_stop = ret;
  if (ret != -EIO)
    {
      goto failed;
    }

  diag->state = 2;
  g_bk7258_wdt_fault_next = BK7258_WDT_FAULT_AON_STOP;
  ret = bk7258_wdt_initialize();
  diag->init_aon_stop = ret;
  if (ret != -EIO)
    {
      goto failed;
    }

  diag->state = 3;
  ret = bk7258_wdt_initialize();
  diag->init_retry = ret;
  if (ret < 0)
    {
      goto failed;
    }

  diag->state = 4;
  g_bk7258_wdt_fault_next = BK7258_WDT_FAULT_WDT_STOP;
  ret = bk7258_wdt_stop(&priv->wdt_lh);
  diag->failed_stop = ret;
  (void)bk7258_wdt_getstatus(&priv->wdt_lh, &status);
  diag->active_after_failed_stop =
    (status.flags & WDFLAGS_ACTIVE) != 0;
  if (ret != -EIO || diag->active_after_failed_stop == 0)
    {
      goto failed;
    }

  diag->state = 5;
  ret = bk7258_wdt_stop(&priv->wdt_lh);
  diag->retry_stop = ret;
  (void)bk7258_wdt_getstatus(&priv->wdt_lh, &status);
  diag->active_after_retry_stop =
    (status.flags & WDFLAGS_ACTIVE) != 0;
  if (ret < 0 || diag->active_after_retry_stop != 0)
    {
      goto failed;
    }

  diag->state = 6;
  ret = bk7258_wdt_start(&priv->wdt_lh);
  diag->restart = ret;
  if (ret < 0)
    {
      goto failed;
    }

  bk7258_wdt_pm_prepare();
  ret = bk_wdt_stop();
  if (ret != BK_OK)
    {
      ret = -EIO;
      goto failed;
    }

  g_bk7258_wdt_fault_next = BK7258_WDT_FAULT_WDT_START;
  bk7258_wdt_pm_restore();
  (void)bk7258_wdt_getstatus(&priv->wdt_lh, &status);
  diag->active_after_failed_restore =
    (status.flags & WDFLAGS_ACTIVE) != 0;
  if (diag->active_after_failed_restore != 0)
    {
      ret = -EIO;
      goto failed;
    }

  diag->state = 7;
  ret = bk7258_wdt_start(&priv->wdt_lh);
  diag->recovery_start = ret;
  (void)bk7258_wdt_getstatus(&priv->wdt_lh, &status);
  diag->final_active = (status.flags & WDFLAGS_ACTIVE) != 0;
  if (ret < 0 || diag->final_active == 0)
    {
      goto failed;
    }

  diag->result = OK;
  diag->state = 8;
  return OK;

failed:
  diag->result = ret < 0 ? ret : -EIO;
  diag->state |= 0x80000000u;
  return diag->result;
}
#endif

#endif /* CONFIG_BK7258_WDT */
